HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_CANR_CANR0_RINT3.
* To use register names with standard convension, please use SRC_CANR_CANR0_RINT3.
*/
#define	SRC_CANRINT3	(SRC_CANR_CANR0_RINT3)

/** \\brief  950, MULTICANr+ Service Request */
#define SRC_CANR_CANR0_RINT4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038950u)

/** Alias (User Manual Name) for SRC_CANR_CANR0_RINT4.
* To use register names with standard convension, please use SRC_CANR_CANR0_RINT4.
*/
#define	SRC_CANRINT4	(SRC_CANR_CANR0_RINT4)

/** \\brief  954, MULTICANr+ Service Request */
#define SRC_CANR_CANR0_RINT5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038954u)

/** Alias (User Manual Name) for SRC_CANR_CANR0_RINT5.
* To use register names with standard convension, please use SRC_CANR_CANR0_RINT5.
*/
#define	SRC_CANRINT5	(SRC_CANR_CANR0_RINT5)

/** \\brief  958, MULTICANr+ Service Request */
#define SRC_CANR_CANR0_RINT6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038958u)

/** Alias (User Manual Name) for SRC_CANR_CANR0_RINT6.
* To use register names with standard convension, please use SRC_CANR_CANR0_RINT6.
*/
#define	SRC_CANRINT6	(SRC_CANR_CANR0_RINT6)

/** \\brief  95C, MULTICANr+ Service Request */
#define SRC_CANR_CANR0_RINT7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003895Cu)

/** Alias (User Manual Name) for SRC_CANR_CANR0_RINT7.
* To use register names with standard convension, please use SRC_CANR_CANR0_RINT7.
*/
#define	SRC_CANRINT7	(SRC_CANR_CANR0_RINT7)

/** \\brief  420, CCU6 Service Request 0 */
#define SRC_CCU6_CCU60_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038420u)

/** Alias (User Manual Name) for SRC_CCU6_CCU60_SR0.
* To use register names with standard convension, please use SRC_CCU6_CCU60_SR0.
*/
#define	SRC_CCU60SR0	(SRC_CCU6_CCU60_SR0)

/** \\brief  424, CCU6 Service Request 1 */
#define SRC_CCU6_CCU60_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038424u)

/** Alias (User Manual Name) for SRC_CCU6_CCU60_SR1.
* To use register names with standard convension, please use SRC_CCU6_CCU60_SR1.
*/
#define	SRC_CCU60SR1	(SRC_CCU6_CCU60_SR1)

/** \\brief  428, CCU6 Service Request 2 */
#define SRC_CCU6_CCU60_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038428u)

/** Alias (User Manual Name) for SRC_CCU6_CCU60_SR2.
* To use register names with standard convension, please use SRC_CCU6_CCU60_SR2.
*/
#define	SRC_CCU60SR2	(SRC_CCU6_CCU60_SR2)

/** \\brief  42C, CCU6 Service Request 3 */
#define SRC_CCU6_CCU60_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003842Cu)

/** Alias (User Manual Name) for SRC_CCU6_CCU60_SR3.
* To use register names with standard convension, please use SRC_CCU6_CCU60_SR3.
*/
#define	SRC_CCU60SR3	(SRC_CCU6_CCU60_SR3)

/** \\brief  430, CCU6 Service Request 0 */
#define SRC_CCU6_CCU61_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038430u)

/** Alias (User Manual Name) for SRC_CCU6_CCU61_SR0.
* To use register names with standard convension, please use SRC_CCU6_CCU61_SR0.
*/
#define	SRC_CCU61SR0	(SRC_CCU6_CCU61_SR0)

/** \\brief  434, CCU6 Service Request 1 */
#define SRC_CCU6_CCU61_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038434u)

/** Alias (User Manual Name) for SRC_CCU6_CCU61_SR1.
* To use register names with standard convension, please use SRC_CCU6_CCU61_SR1.
*/
#define	SRC_CCU61SR1	(SRC_CCU6_CCU61_SR1)

/** \\brief  438, CCU6 Service Request 2 */
#define SRC_CCU6_CCU61_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038438u)

/** Alias (User Manual Name) for SRC_CCU6_CCU61_SR2.
* To use register names with standard convension, please use SRC_CCU6_CCU61_SR2.
*/
#define	SRC_CCU61SR2	(SRC_CCU6_CCU61_SR2)

/** \\brief  43C, CCU6 Service Request 3 */
#define SRC_CCU6_CCU61_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003843Cu)

/** Alias (User Manual Name) for SRC_CCU6_CCU61_SR3.
* To use register names with standard convension, please use SRC_CCU6_CCU61_SR3.
*/
#define	SRC_CCU61SR3	(SRC_CCU6_CCU61_SR3)

/** \\brief  50, Cerberus Service Request */
#define SRC_CERBERUS_CERBERUS_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038050u)

/** Alias (User Manual Name) for SRC_CERBERUS_CERBERUS_SR0.
* To use register names with standard convension, please use SRC_CERBERUS_CERBERUS_SR0.
*/
#define	SRC_CERBERUS0	(SRC_CERBERUS_CERBERUS_SR0)

/** \\brief  54, Cerberus Service Request */
#define SRC_CERBERUS_CERBERUS_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038054u)

/** Alias (User Manual Name) for SRC_CERBERUS_CERBERUS_SR1.
* To use register names with standard convension, please use SRC_CERBERUS_CERBERUS_SR1.
*/
#define	SRC_CERBERUS1	(SRC_CERBERUS_CERBERUS_SR1)

/** \\brief  DA8, CIF ISP Service Request */
#define SRC_CIF_CIF0_ISP /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DA8u)

/** Alias (User Manual Name) for SRC_CIF_CIF0_ISP.
* To use register names with standard convension, please use SRC_CIF_CIF0_ISP.
*/
#define	SRC_CIFISP	(SRC_CIF_CIF0_ISP)

/** \\brief  DA0, CIF MI Service Request */
#define SRC_CIF_CIF0_MI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DA0u)

/** Alias (User Manual Name) for SRC_CIF_CIF0_MI.
* To use register names with standard convension, please use SRC_CIF_CIF0_MI.
*/
#define	SRC_CIFMI	(SRC_CIF_CIF0_MI)

/** \\brief  DA4, CIF MI EP Service Request */
#define SRC_CIF_CIF0_MIEP /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DA4u)

/** Alias (User Manual Name) for SRC_CIF_CIF0_MIEP.
* To use register names with standard convension, please use SRC_CIF_CIF0_MIEP.
*/
#define	SRC_CIFMIEP	(SRC_CIF_CIF0_MIEP)

/** \\brief  DAC, CIF MJPEG Service Request */
#define SRC_CIF_CIF0_MJPEG /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DACu)

/** Alias (User Manual Name) for SRC_CIF_CIF0_MJPEG.
* To use register names with standard convension, please use SRC_CIF_CIF0_MJPEG.
*/
#define	SRC_CIFMJPEG	(SRC_CIF_CIF0_MJPEG)

/** \\brief  0, CPU Software Breakpoint Service Request */
#define SRC_CPU_CPU0_SBSRC /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038000u)

/** Alias (User Manual Name) for SRC_CPU_CPU0_SBSRC.
* To use register names with standard convension, please use SRC_CPU_CPU0_SBSRC.
*/
#define	SRC_CPU0SBSRC	(SRC_CPU_CPU0_SBSRC)

/** \\brief  4, CPU Software Breakpoint Service Request */
#define SRC_CPU_CPU1_SBSRC /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038004u)

/** Alias (User Manual Name) for SRC_CPU_CPU1_SBSRC.
* To use register names with standard convension, please use SRC_CPU_CPU1_SBSRC.
*/
#define	SRC_CPU1SBSRC	(SRC_CPU_CPU1_SBSRC)

/** \\brief  8, CPU Software Breakpoint Service Request */
#define SRC_CPU_CPU2_SBSRC /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038008u)

/** Alias (User Manual Name) for SRC_CPU_CPU2_SBSRC.
* To use register names with standard convension, please use SRC_CPU_CPU2_SBSRC.
*/
#define	SRC_CPU2SBSRC	(SRC_CPU_CPU2_SBSRC)

/** \\brief  D70, DAM Service Request */
#define SRC_DAM_DAM0_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D70u)

/** Alias (User Manual Name) for SRC_DAM_DAM0_SR0.
* To use register names with standard convension, please use SRC_DAM_DAM0_SR0.
*/
#define	SRC_DAM0	(SRC_DAM_DAM0_SR0)

