HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** \\brief  D74, DAM Service Request */
#define SRC_DAM_DAM0_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D74u)

/** Alias (User Manual Name) for SRC_DAM_DAM0_SR1.
* To use register names with standard convension, please use SRC_DAM_DAM0_SR1.
*/
#define	SRC_DAM1	(SRC_DAM_DAM0_SR1)

/** \\brief  D78, DAM Service Request */
#define SRC_DAM_DAM0_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D78u)

/** Alias (User Manual Name) for SRC_DAM_DAM0_SR2.
* To use register names with standard convension, please use SRC_DAM_DAM0_SR2.
*/
#define	SRC_DAM2	(SRC_DAM_DAM0_SR2)

/** \\brief  D7C, DAM Service Request */
#define SRC_DAM_DAM0_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D7Cu)

/** Alias (User Manual Name) for SRC_DAM_DAM0_SR3.
* To use register names with standard convension, please use SRC_DAM_DAM0_SR3.
*/
#define	SRC_DAM3	(SRC_DAM_DAM0_SR3)

/** \\brief  D80, DAM Service Request */
#define SRC_DAM_DAM0_SR4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D80u)

/** Alias (User Manual Name) for SRC_DAM_DAM0_SR4.
* To use register names with standard convension, please use SRC_DAM_DAM0_SR4.
*/
#define	SRC_DAM4	(SRC_DAM_DAM0_SR4)

/** \\brief  D84, DAM Service Request */
#define SRC_DAM_DAM0_SR5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D84u)

/** Alias (User Manual Name) for SRC_DAM_DAM0_SR5.
* To use register names with standard convension, please use SRC_DAM_DAM0_SR5.
*/
#define	SRC_DAM5	(SRC_DAM_DAM0_SR5)

/** \\brief  500, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038500u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH0.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH0.
*/
#define	SRC_DMACH0	(SRC_DMA_DMA0_CH0)

/** \\brief  504, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038504u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH1.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH1.
*/
#define	SRC_DMACH1	(SRC_DMA_DMA0_CH1)

/** \\brief  528, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH10 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038528u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH10.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH10.
*/
#define	SRC_DMACH10	(SRC_DMA_DMA0_CH10)

/** \\brief  690, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH100 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038690u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH100.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH100.
*/
#define	SRC_DMACH100	(SRC_DMA_DMA0_CH100)

/** \\brief  694, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH101 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038694u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH101.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH101.
*/
#define	SRC_DMACH101	(SRC_DMA_DMA0_CH101)

/** \\brief  698, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH102 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038698u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH102.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH102.
*/
#define	SRC_DMACH102	(SRC_DMA_DMA0_CH102)

/** \\brief  69C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH103 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003869Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH103.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH103.
*/
#define	SRC_DMACH103	(SRC_DMA_DMA0_CH103)

/** \\brief  6A0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH104 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386A0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH104.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH104.
*/
#define	SRC_DMACH104	(SRC_DMA_DMA0_CH104)

/** \\brief  6A4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH105 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386A4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH105.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH105.
*/
#define	SRC_DMACH105	(SRC_DMA_DMA0_CH105)

/** \\brief  6A8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH106 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386A8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH106.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH106.
*/
#define	SRC_DMACH106	(SRC_DMA_DMA0_CH106)

/** \\brief  6AC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH107 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386ACu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH107.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH107.
*/
#define	SRC_DMACH107	(SRC_DMA_DMA0_CH107)

/** \\brief  6B0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH108 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386B0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH108.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH108.
*/
#define	SRC_DMACH108	(SRC_DMA_DMA0_CH108)

/** \\brief  6B4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH109 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386B4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH109.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH109.
*/
#define	SRC_DMACH109	(SRC_DMA_DMA0_CH109)

/** \\brief  52C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH11 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003852Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH11.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH11.
*/
#define	SRC_DMACH11	(SRC_DMA_DMA0_CH11)

/** \\brief  6B8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH110 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386B8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH110.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH110.
*/
#define	SRC_DMACH110	(SRC_DMA_DMA0_CH110)

/** \\brief  6BC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH111 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386BCu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH111.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH111.
*/
#define	SRC_DMACH111	(SRC_DMA_DMA0_CH111)

