HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** \\brief  6C0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH112 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386C0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH112.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH112.
*/
#define	SRC_DMACH112	(SRC_DMA_DMA0_CH112)

/** \\brief  6C4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH113 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386C4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH113.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH113.
*/
#define	SRC_DMACH113	(SRC_DMA_DMA0_CH113)

/** \\brief  6C8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH114 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386C8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH114.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH114.
*/
#define	SRC_DMACH114	(SRC_DMA_DMA0_CH114)

/** \\brief  6CC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH115 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386CCu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH115.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH115.
*/
#define	SRC_DMACH115	(SRC_DMA_DMA0_CH115)

/** \\brief  6D0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH116 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386D0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH116.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH116.
*/
#define	SRC_DMACH116	(SRC_DMA_DMA0_CH116)

/** \\brief  6D4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH117 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386D4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH117.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH117.
*/
#define	SRC_DMACH117	(SRC_DMA_DMA0_CH117)

/** \\brief  6D8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH118 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386D8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH118.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH118.
*/
#define	SRC_DMACH118	(SRC_DMA_DMA0_CH118)

/** \\brief  6DC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH119 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386DCu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH119.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH119.
*/
#define	SRC_DMACH119	(SRC_DMA_DMA0_CH119)

/** \\brief  530, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH12 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038530u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH12.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH12.
*/
#define	SRC_DMACH12	(SRC_DMA_DMA0_CH12)

/** \\brief  6E0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH120 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386E0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH120.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH120.
*/
#define	SRC_DMACH120	(SRC_DMA_DMA0_CH120)

/** \\brief  6E4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH121 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386E4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH121.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH121.
*/
#define	SRC_DMACH121	(SRC_DMA_DMA0_CH121)

/** \\brief  6E8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH122 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386E8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH122.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH122.
*/
#define	SRC_DMACH122	(SRC_DMA_DMA0_CH122)

/** \\brief  6EC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH123 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386ECu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH123.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH123.
*/
#define	SRC_DMACH123	(SRC_DMA_DMA0_CH123)

/** \\brief  6F0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH124 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386F0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH124.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH124.
*/
#define	SRC_DMACH124	(SRC_DMA_DMA0_CH124)

/** \\brief  6F4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH125 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386F4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH125.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH125.
*/
#define	SRC_DMACH125	(SRC_DMA_DMA0_CH125)

/** \\brief  6F8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH126 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386F8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH126.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH126.
*/
#define	SRC_DMACH126	(SRC_DMA_DMA0_CH126)

/** \\brief  6FC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH127 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386FCu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH127.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH127.
*/
#define	SRC_DMACH127	(SRC_DMA_DMA0_CH127)

/** \\brief  534, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH13 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038534u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH13.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH13.
*/
#define	SRC_DMACH13	(SRC_DMA_DMA0_CH13)

/** \\brief  538, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH14 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038538u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH14.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH14.
*/
#define	SRC_DMACH14	(SRC_DMA_DMA0_CH14)

/** \\brief  53C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH15 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003853Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH15.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH15.
*/
#define	SRC_DMACH15	(SRC_DMA_DMA0_CH15)

/** \\brief  540, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH16 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038540u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH16.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH16.
*/
#define	SRC_DMACH16	(SRC_DMA_DMA0_CH16)

/** \\brief  544, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH17 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038544u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH17.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH17.
*/
#define	SRC_DMACH17	(SRC_DMA_DMA0_CH17)

/** \\brief  548, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH18 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038548u)

