HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH54.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH54.
*/
#define	SRC_DMACH54	(SRC_DMA_DMA0_CH54)

/** \\brief  5DC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH55 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385DCu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH55.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH55.
*/
#define	SRC_DMACH55	(SRC_DMA_DMA0_CH55)

/** \\brief  5E0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH56 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385E0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH56.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH56.
*/
#define	SRC_DMACH56	(SRC_DMA_DMA0_CH56)

/** \\brief  5E4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH57 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385E4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH57.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH57.
*/
#define	SRC_DMACH57	(SRC_DMA_DMA0_CH57)

/** \\brief  5E8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH58 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385E8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH58.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH58.
*/
#define	SRC_DMACH58	(SRC_DMA_DMA0_CH58)

/** \\brief  5EC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH59 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385ECu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH59.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH59.
*/
#define	SRC_DMACH59	(SRC_DMA_DMA0_CH59)

/** \\brief  518, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038518u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH6.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH6.
*/
#define	SRC_DMACH6	(SRC_DMA_DMA0_CH6)

/** \\brief  5F0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH60 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385F0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH60.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH60.
*/
#define	SRC_DMACH60	(SRC_DMA_DMA0_CH60)

/** \\brief  5F4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH61 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385F4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH61.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH61.
*/
#define	SRC_DMACH61	(SRC_DMA_DMA0_CH61)

/** \\brief  5F8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH62 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385F8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH62.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH62.
*/
#define	SRC_DMACH62	(SRC_DMA_DMA0_CH62)

/** \\brief  5FC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH63 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385FCu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH63.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH63.
*/
#define	SRC_DMACH63	(SRC_DMA_DMA0_CH63)

/** \\brief  600, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH64 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038600u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH64.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH64.
*/
#define	SRC_DMACH64	(SRC_DMA_DMA0_CH64)

/** \\brief  604, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH65 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038604u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH65.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH65.
*/
#define	SRC_DMACH65	(SRC_DMA_DMA0_CH65)

/** \\brief  608, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH66 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038608u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH66.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH66.
*/
#define	SRC_DMACH66	(SRC_DMA_DMA0_CH66)

/** \\brief  60C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH67 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003860Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH67.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH67.
*/
#define	SRC_DMACH67	(SRC_DMA_DMA0_CH67)

/** \\brief  610, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH68 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038610u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH68.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH68.
*/
#define	SRC_DMACH68	(SRC_DMA_DMA0_CH68)

/** \\brief  614, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH69 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038614u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH69.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH69.
*/
#define	SRC_DMACH69	(SRC_DMA_DMA0_CH69)

/** \\brief  51C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003851Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH7.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH7.
*/
#define	SRC_DMACH7	(SRC_DMA_DMA0_CH7)

/** \\brief  618, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH70 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038618u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH70.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH70.
*/
#define	SRC_DMACH70	(SRC_DMA_DMA0_CH70)

/** \\brief  61C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH71 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003861Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH71.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH71.
*/
#define	SRC_DMACH71	(SRC_DMA_DMA0_CH71)

/** \\brief  620, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH72 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038620u)

