HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH72.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH72.
*/
#define	SRC_DMACH72	(SRC_DMA_DMA0_CH72)

/** \\brief  624, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH73 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038624u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH73.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH73.
*/
#define	SRC_DMACH73	(SRC_DMA_DMA0_CH73)

/** \\brief  628, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH74 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038628u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH74.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH74.
*/
#define	SRC_DMACH74	(SRC_DMA_DMA0_CH74)

/** \\brief  62C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH75 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003862Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH75.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH75.
*/
#define	SRC_DMACH75	(SRC_DMA_DMA0_CH75)

/** \\brief  630, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH76 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038630u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH76.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH76.
*/
#define	SRC_DMACH76	(SRC_DMA_DMA0_CH76)

/** \\brief  634, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH77 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038634u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH77.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH77.
*/
#define	SRC_DMACH77	(SRC_DMA_DMA0_CH77)

/** \\brief  638, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH78 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038638u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH78.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH78.
*/
#define	SRC_DMACH78	(SRC_DMA_DMA0_CH78)

/** \\brief  63C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH79 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003863Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH79.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH79.
*/
#define	SRC_DMACH79	(SRC_DMA_DMA0_CH79)

/** \\brief  520, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH8 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038520u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH8.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH8.
*/
#define	SRC_DMACH8	(SRC_DMA_DMA0_CH8)

/** \\brief  640, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH80 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038640u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH80.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH80.
*/
#define	SRC_DMACH80	(SRC_DMA_DMA0_CH80)

/** \\brief  644, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH81 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038644u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH81.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH81.
*/
#define	SRC_DMACH81	(SRC_DMA_DMA0_CH81)

/** \\brief  648, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH82 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038648u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH82.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH82.
*/
#define	SRC_DMACH82	(SRC_DMA_DMA0_CH82)

/** \\brief  64C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH83 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003864Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH83.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH83.
*/
#define	SRC_DMACH83	(SRC_DMA_DMA0_CH83)

/** \\brief  650, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH84 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038650u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH84.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH84.
*/
#define	SRC_DMACH84	(SRC_DMA_DMA0_CH84)

/** \\brief  654, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH85 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038654u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH85.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH85.
*/
#define	SRC_DMACH85	(SRC_DMA_DMA0_CH85)

/** \\brief  658, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH86 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038658u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH86.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH86.
*/
#define	SRC_DMACH86	(SRC_DMA_DMA0_CH86)

/** \\brief  65C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH87 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003865Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH87.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH87.
*/
#define	SRC_DMACH87	(SRC_DMA_DMA0_CH87)

/** \\brief  660, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH88 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038660u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH88.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH88.
*/
#define	SRC_DMACH88	(SRC_DMA_DMA0_CH88)

/** \\brief  664, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH89 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038664u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH89.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH89.
*/
#define	SRC_DMACH89	(SRC_DMA_DMA0_CH89)

/** \\brief  524, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH9 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038524u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH9.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH9.
*/
#define	SRC_DMACH9	(SRC_DMA_DMA0_CH9)

/** \\brief  668, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH90 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038668u)

