HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH90.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH90.
*/
#define	SRC_DMACH90	(SRC_DMA_DMA0_CH90)

/** \\brief  66C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH91 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003866Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH91.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH91.
*/
#define	SRC_DMACH91	(SRC_DMA_DMA0_CH91)

/** \\brief  670, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH92 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038670u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH92.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH92.
*/
#define	SRC_DMACH92	(SRC_DMA_DMA0_CH92)

/** \\brief  674, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH93 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038674u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH93.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH93.
*/
#define	SRC_DMACH93	(SRC_DMA_DMA0_CH93)

/** \\brief  678, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH94 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038678u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH94.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH94.
*/
#define	SRC_DMACH94	(SRC_DMA_DMA0_CH94)

/** \\brief  67C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH95 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003867Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH95.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH95.
*/
#define	SRC_DMACH95	(SRC_DMA_DMA0_CH95)

/** \\brief  680, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH96 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038680u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH96.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH96.
*/
#define	SRC_DMACH96	(SRC_DMA_DMA0_CH96)

/** \\brief  684, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH97 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038684u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH97.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH97.
*/
#define	SRC_DMACH97	(SRC_DMA_DMA0_CH97)

/** \\brief  688, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH98 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038688u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH98.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH98.
*/
#define	SRC_DMACH98	(SRC_DMA_DMA0_CH98)

/** \\brief  68C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH99 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003868Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH99.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH99.
*/
#define	SRC_DMACH99	(SRC_DMA_DMA0_CH99)

/** \\brief  4F0, DMA Error Service Request */
#define SRC_DMA_DMA0_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_ERR.
* To use register names with standard convension, please use SRC_DMA_DMA0_ERR.
*/
#define	SRC_DMAERR	(SRC_DMA_DMA0_ERR)

/** \\brief  B54, DSADC SRA Service Request */
#define SRC_DSADC_DSADC0_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B54u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC0_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC0_SRA.
*/
#define	SRC_DSADCSRA0	(SRC_DSADC_DSADC0_SRA)

/** \\brief  B50, DSADC SRM Service Request */
#define SRC_DSADC_DSADC0_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B50u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC0_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC0_SRM.
*/
#define	SRC_DSADCSRM0	(SRC_DSADC_DSADC0_SRM)

/** \\brief  B5C, DSADC SRA Service Request */
#define SRC_DSADC_DSADC1_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B5Cu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC1_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC1_SRA.
*/
#define	SRC_DSADCSRA1	(SRC_DSADC_DSADC1_SRA)

/** \\brief  B58, DSADC SRM Service Request */
#define SRC_DSADC_DSADC1_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B58u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC1_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC1_SRM.
*/
#define	SRC_DSADCSRM1	(SRC_DSADC_DSADC1_SRM)

/** \\brief  B64, DSADC SRA Service Request */
#define SRC_DSADC_DSADC2_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B64u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC2_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC2_SRA.
*/
#define	SRC_DSADCSRA2	(SRC_DSADC_DSADC2_SRA)

/** \\brief  B60, DSADC SRM Service Request */
#define SRC_DSADC_DSADC2_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B60u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC2_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC2_SRM.
*/
#define	SRC_DSADCSRM2	(SRC_DSADC_DSADC2_SRM)

/** \\brief  B6C, DSADC SRA Service Request */
#define SRC_DSADC_DSADC3_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B6Cu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC3_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC3_SRA.
*/
#define	SRC_DSADCSRA3	(SRC_DSADC_DSADC3_SRA)

/** \\brief  B68, DSADC SRM Service Request */
#define SRC_DSADC_DSADC3_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B68u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC3_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC3_SRM.
*/
#define	SRC_DSADCSRM3	(SRC_DSADC_DSADC3_SRM)

/** \\brief  B74, DSADC SRA Service Request */
#define SRC_DSADC_DSADC4_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B74u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC4_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC4_SRA.
*/
#define	SRC_DSADCSRA4	(SRC_DSADC_DSADC4_SRA)

/** \\brief  B70, DSADC SRM Service Request */
#define SRC_DSADC_DSADC4_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B70u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC4_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC4_SRM.
*/
#define	SRC_DSADCSRM4	(SRC_DSADC_DSADC4_SRM)

/** \\brief  B7C, DSADC SRA Service Request */
#define SRC_DSADC_DSADC5_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B7Cu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC5_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC5_SRA.
*/
#define	SRC_DSADCSRA5	(SRC_DSADC_DSADC5_SRA)

/** \\brief  B78, DSADC SRM Service Request */
#define SRC_DSADC_DSADC5_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B78u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC5_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC5_SRM.
*/
#define	SRC_DSADCSRM5	(SRC_DSADC_DSADC5_SRM)

