HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** \\brief  B84, DSADC SRA Service Request */
#define SRC_DSADC_DSADC6_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B84u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC6_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC6_SRA.
*/
#define	SRC_DSADCSRA6	(SRC_DSADC_DSADC6_SRA)

/** \\brief  B80, DSADC SRM Service Request */
#define SRC_DSADC_DSADC6_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B80u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC6_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC6_SRM.
*/
#define	SRC_DSADCSRM6	(SRC_DSADC_DSADC6_SRM)

/** \\brief  B8C, DSADC SRA Service Request */
#define SRC_DSADC_DSADC7_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B8Cu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC7_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC7_SRA.
*/
#define	SRC_DSADCSRA7	(SRC_DSADC_DSADC7_SRA)

/** \\brief  B88, DSADC SRM Service Request */
#define SRC_DSADC_DSADC7_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B88u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC7_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC7_SRM.
*/
#define	SRC_DSADCSRM7	(SRC_DSADC_DSADC7_SRM)

/** \\brief  B94, DSADC SRA Service Request */
#define SRC_DSADC_DSADC8_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B94u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC8_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC8_SRA.
*/
#define	SRC_DSADCSRA8	(SRC_DSADC_DSADC8_SRA)

/** \\brief  B90, DSADC SRM Service Request */
#define SRC_DSADC_DSADC8_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B90u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC8_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC8_SRM.
*/
#define	SRC_DSADCSRM8	(SRC_DSADC_DSADC8_SRM)

/** \\brief  B9C, DSADC SRA Service Request */
#define SRC_DSADC_DSADC9_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B9Cu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC9_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC9_SRA.
*/
#define	SRC_DSADCSRA9	(SRC_DSADC_DSADC9_SRA)

/** \\brief  B98, DSADC SRM Service Request */
#define SRC_DSADC_DSADC9_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B98u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC9_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC9_SRM.
*/
#define	SRC_DSADCSRM9	(SRC_DSADC_DSADC9_SRM)

/** \\brief  20, Emulation Memory Service Request */
#define SRC_EMEM_EMEM0_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038020u)

/** Alias (User Manual Name) for SRC_EMEM_EMEM0_SR.
* To use register names with standard convension, please use SRC_EMEM_EMEM0_SR.
*/
#define	SRC_EMEM	(SRC_EMEM_EMEM0_SR)

/** \\brief  C04, E-RAY Input Buffer Busy Service Request */
#define SRC_ERAY_ERAY0_IBUSY /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C04u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_IBUSY.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_IBUSY.
*/
#define	SRC_ERAY0IBUSY	(SRC_ERAY_ERAY0_IBUSY)

/** \\brief  BE0, E-RAY  Service Request */
#define SRC_ERAY_ERAY0_INT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BE0u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_INT0.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_INT0.
*/
#define	SRC_ERAY0INT0	(SRC_ERAY_ERAY0_INT0)

/** \\brief  BE4, E-RAY  Service Request */
#define SRC_ERAY_ERAY0_INT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BE4u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_INT1.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_INT1.
*/
#define	SRC_ERAY0INT1	(SRC_ERAY_ERAY0_INT1)

/** \\brief  BF8, E-RAY  Message Buffer Status Changed Service Request */
#define SRC_ERAY_ERAY0_MBSC0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BF8u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_MBSC0.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_MBSC0.
*/
#define	SRC_ERAY0MBSC0	(SRC_ERAY_ERAY0_MBSC0)

/** \\brief  BFC, E-RAY  Message Buffer Status Changed Service Request */
#define SRC_ERAY_ERAY0_MBSC1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BFCu)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_MBSC1.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_MBSC1.
*/
#define	SRC_ERAY0MBSC1	(SRC_ERAY_ERAY0_MBSC1)

/** \\brief  BF0, E-RAY  New Data Service Request */
#define SRC_ERAY_ERAY0_NDAT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BF0u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_NDAT0.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_NDAT0.
*/
#define	SRC_ERAY0NDAT0	(SRC_ERAY_ERAY0_NDAT0)

/** \\brief  BF4, E-RAY  New Data Service Request */
#define SRC_ERAY_ERAY0_NDAT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BF4u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_NDAT1.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_NDAT1.
*/
#define	SRC_ERAY0NDAT1	(SRC_ERAY_ERAY0_NDAT1)

/** \\brief  C00, E-RAY Output Buffer Busy Service Request */
#define SRC_ERAY_ERAY0_OBUSY /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C00u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_OBUSY.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_OBUSY.
*/
#define	SRC_ERAY0OBUSY	(SRC_ERAY_ERAY0_OBUSY)

/** \\brief  BE8, E-RAY  Timer Interrupt Service Request */
#define SRC_ERAY_ERAY0_TINT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BE8u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_TINT0.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_TINT0.
*/
#define	SRC_ERAY0TINT0	(SRC_ERAY_ERAY0_TINT0)

/** \\brief  BEC, E-RAY  Timer Interrupt Service Request */
#define SRC_ERAY_ERAY0_TINT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BECu)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_TINT1.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_TINT1.
*/
#define	SRC_ERAY0TINT1	(SRC_ERAY_ERAY0_TINT1)

