HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** \\brief  C2C, E-RAY Input Buffer Busy Service Request */
#define SRC_ERAY_ERAY1_IBUSY /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C2Cu)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_IBUSY.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_IBUSY.
*/
#define	SRC_ERAY1IBUSY	(SRC_ERAY_ERAY1_IBUSY)

/** \\brief  C08, E-RAY  Service Request */
#define SRC_ERAY_ERAY1_INT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C08u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_INT0.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_INT0.
*/
#define	SRC_ERAY1INT0	(SRC_ERAY_ERAY1_INT0)

/** \\brief  C0C, E-RAY  Service Request */
#define SRC_ERAY_ERAY1_INT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C0Cu)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_INT1.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_INT1.
*/
#define	SRC_ERAY1INT1	(SRC_ERAY_ERAY1_INT1)

/** \\brief  C20, E-RAY  Message Buffer Status Changed Service Request */
#define SRC_ERAY_ERAY1_MBSC0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C20u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_MBSC0.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_MBSC0.
*/
#define	SRC_ERAY1MBSC0	(SRC_ERAY_ERAY1_MBSC0)

/** \\brief  C24, E-RAY  Message Buffer Status Changed Service Request */
#define SRC_ERAY_ERAY1_MBSC1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C24u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_MBSC1.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_MBSC1.
*/
#define	SRC_ERAY1MBSC1	(SRC_ERAY_ERAY1_MBSC1)

/** \\brief  C18, E-RAY  New Data Service Request */
#define SRC_ERAY_ERAY1_NDAT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C18u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_NDAT0.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_NDAT0.
*/
#define	SRC_ERAY1NDAT0	(SRC_ERAY_ERAY1_NDAT0)

/** \\brief  C1C, E-RAY  New Data Service Request */
#define SRC_ERAY_ERAY1_NDAT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C1Cu)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_NDAT1.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_NDAT1.
*/
#define	SRC_ERAY1NDAT1	(SRC_ERAY_ERAY1_NDAT1)

/** \\brief  C28, E-RAY Output Buffer Busy Service Request */
#define SRC_ERAY_ERAY1_OBUSY /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C28u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_OBUSY.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_OBUSY.
*/
#define	SRC_ERAY1OBUSY	(SRC_ERAY_ERAY1_OBUSY)

/** \\brief  C10, E-RAY  Timer Interrupt Service Request */
#define SRC_ERAY_ERAY1_TINT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C10u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_TINT0.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_TINT0.
*/
#define	SRC_ERAY1TINT0	(SRC_ERAY_ERAY1_TINT0)

/** \\brief  C14, E-RAY  Timer Interrupt Service Request */
#define SRC_ERAY_ERAY1_TINT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C14u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_TINT1.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_TINT1.
*/
#define	SRC_ERAY1TINT1	(SRC_ERAY_ERAY1_TINT1)

/** \\brief  8F0, Ethernet Service Request */
#define SRC_ETH_ETH0_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00388F0u)

/** Alias (User Manual Name) for SRC_ETH_ETH0_SR.
* To use register names with standard convension, please use SRC_ETH_ETH0_SR.
*/
#define	SRC_ETH	(SRC_ETH_ETH0_SR)

/** \\brief  4B0, FCE Error Service Request */
#define SRC_FCE_FCE0_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384B0u)

/** Alias (User Manual Name) for SRC_FCE_FCE0_SR.
* To use register names with standard convension, please use SRC_FCE_FCE0_SR.
*/
#define	SRC_FCE	(SRC_FCE_FCE0_SR)

/** \\brief  FC0, FFT Done Service Request */
#define SRC_FFT_FFT0_DONE /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FC0u)

/** Alias (User Manual Name) for SRC_FFT_FFT0_DONE.
* To use register names with standard convension, please use SRC_FFT_FFT0_DONE.
*/
#define	SRC_FFTDONE	(SRC_FFT_FFT0_DONE)

/** \\brief  FC4, FFT Error Service Request */
#define SRC_FFT_FFT0_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FC4u)

/** Alias (User Manual Name) for SRC_FFT_FFT0_ERR.
* To use register names with standard convension, please use SRC_FFT_FFT0_ERR.
*/
#define	SRC_FFTERR	(SRC_FFT_FFT0_ERR)

/** \\brief  FC8, FFT Ready For Start Service Request */
#define SRC_FFT_FFT0_RFS /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FC8u)

/** Alias (User Manual Name) for SRC_FFT_FFT0_RFS.
* To use register names with standard convension, please use SRC_FFT_FFT0_RFS.
*/
#define	SRC_FFTRFS	(SRC_FFT_FFT0_RFS)

/** \\brief  1000, General Purpose Service Request 0 */
#define SRC_GPSR_GPSR0_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039000u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR0.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR0.
*/
#define	SRC_GPSR00	(SRC_GPSR_GPSR0_SR0)

/** \\brief  1004, General Purpose Service Request 1 */
#define SRC_GPSR_GPSR0_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039004u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR1.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR1.
*/
#define	SRC_GPSR01	(SRC_GPSR_GPSR0_SR1)

/** \\brief  1008, General Purpose Service Request 2 */
#define SRC_GPSR_GPSR0_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039008u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR2.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR2.
*/
#define	SRC_GPSR02	(SRC_GPSR_GPSR0_SR2)

/** \\brief  100C, General Purpose Service Request 3 */
#define SRC_GPSR_GPSR0_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003900Cu)

/** Alias (User Manual Name) for SRC_GPSR_GPSR0_SR3.
* To use register names with standard convension, please use SRC_GPSR_GPSR0_SR3.
*/
#define	SRC_GPSR03	(SRC_GPSR_GPSR0_SR3)

/** \\brief  1020, General Purpose Service Request 0 */
#define SRC_GPSR_GPSR1_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039020u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR1_SR0.
* To use register names with standard convension, please use SRC_GPSR_GPSR1_SR0.
*/
#define	SRC_GPSR10	(SRC_GPSR_GPSR1_SR0)

/** \\brief  1024, General Purpose Service Request 1 */
#define SRC_GPSR_GPSR1_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039024u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR1_SR1.
* To use register names with standard convension, please use SRC_GPSR_GPSR1_SR1.
*/
#define	SRC_GPSR11	(SRC_GPSR_GPSR1_SR1)

/** \\brief  1028, General Purpose Service Request 2 */
#define SRC_GPSR_GPSR1_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039028u)

