HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** \\brief  1D94, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM1_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039D94u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM1_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM1_1.
*/
#define	SRC_GTMATOM11	(SRC_GTM_GTM0_ATOM1_1)

/** \\brief  1D98, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM1_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039D98u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM1_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM1_2.
*/
#define	SRC_GTMATOM12	(SRC_GTM_GTM0_ATOM1_2)

/** \\brief  1D9C, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM1_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039D9Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM1_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM1_3.
*/
#define	SRC_GTMATOM13	(SRC_GTM_GTM0_ATOM1_3)

/** \\brief  1DA0, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM2_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DA0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM2_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM2_0.
*/
#define	SRC_GTMATOM20	(SRC_GTM_GTM0_ATOM2_0)

/** \\brief  1DA4, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM2_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DA4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM2_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM2_1.
*/
#define	SRC_GTMATOM21	(SRC_GTM_GTM0_ATOM2_1)

/** \\brief  1DA8, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM2_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DA8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM2_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM2_2.
*/
#define	SRC_GTMATOM22	(SRC_GTM_GTM0_ATOM2_2)

/** \\brief  1DAC, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM2_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DACu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM2_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM2_3.
*/
#define	SRC_GTMATOM23	(SRC_GTM_GTM0_ATOM2_3)

/** \\brief  1DB0, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM3_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DB0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM3_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM3_0.
*/
#define	SRC_GTMATOM30	(SRC_GTM_GTM0_ATOM3_0)

/** \\brief  1DB4, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM3_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DB4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM3_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM3_1.
*/
#define	SRC_GTMATOM31	(SRC_GTM_GTM0_ATOM3_1)

/** \\brief  1DB8, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM3_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DB8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM3_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM3_2.
*/
#define	SRC_GTMATOM32	(SRC_GTM_GTM0_ATOM3_2)

/** \\brief  1DBC, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM3_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DBCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM3_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM3_3.
*/
#define	SRC_GTMATOM33	(SRC_GTM_GTM0_ATOM3_3)

/** \\brief  1DC0, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM4_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DC0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM4_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM4_0.
*/
#define	SRC_GTMATOM40	(SRC_GTM_GTM0_ATOM4_0)

/** \\brief  1DC4, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM4_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DC4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM4_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM4_1.
*/
#define	SRC_GTMATOM41	(SRC_GTM_GTM0_ATOM4_1)

/** \\brief  1DC8, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM4_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DC8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM4_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM4_2.
*/
#define	SRC_GTMATOM42	(SRC_GTM_GTM0_ATOM4_2)

/** \\brief  1DCC, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM4_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DCCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM4_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM4_3.
*/
#define	SRC_GTMATOM43	(SRC_GTM_GTM0_ATOM4_3)

/** \\brief  1DD0, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM5_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DD0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM5_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM5_0.
*/
#define	SRC_GTMATOM50	(SRC_GTM_GTM0_ATOM5_0)

/** \\brief  1DD4, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM5_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DD4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM5_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM5_1.
*/
#define	SRC_GTMATOM51	(SRC_GTM_GTM0_ATOM5_1)

/** \\brief  1DD8, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM5_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DD8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM5_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM5_2.
*/
#define	SRC_GTMATOM52	(SRC_GTM_GTM0_ATOM5_2)

/** \\brief  1DDC, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM5_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DDCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM5_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM5_3.
*/
#define	SRC_GTMATOM53	(SRC_GTM_GTM0_ATOM5_3)

/** \\brief  1DE0, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM6_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DE0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM6_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM6_0.
*/
#define	SRC_GTMATOM60	(SRC_GTM_GTM0_ATOM6_0)

