HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** \\brief  1DE4, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM6_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DE4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM6_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM6_1.
*/
#define	SRC_GTMATOM61	(SRC_GTM_GTM0_ATOM6_1)

/** \\brief  1DE8, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM6_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DE8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM6_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM6_2.
*/
#define	SRC_GTMATOM62	(SRC_GTM_GTM0_ATOM6_2)

/** \\brief  1DEC, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM6_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DECu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM6_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM6_3.
*/
#define	SRC_GTMATOM63	(SRC_GTM_GTM0_ATOM6_3)

/** \\brief  1DF0, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM7_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DF0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM7_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM7_0.
*/
#define	SRC_GTMATOM70	(SRC_GTM_GTM0_ATOM7_0)

/** \\brief  1DF4, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM7_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DF4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM7_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM7_1.
*/
#define	SRC_GTMATOM71	(SRC_GTM_GTM0_ATOM7_1)

/** \\brief  1DF8, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM7_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DF8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM7_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM7_2.
*/
#define	SRC_GTMATOM72	(SRC_GTM_GTM0_ATOM7_2)

/** \\brief  1DFC, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM7_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039DFCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM7_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM7_3.
*/
#define	SRC_GTMATOM73	(SRC_GTM_GTM0_ATOM7_3)

/** \\brief  1E00, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM8_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039E00u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM8_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM8_0.
*/
#define	SRC_GTMATOM80	(SRC_GTM_GTM0_ATOM8_0)

/** \\brief  1E04, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM8_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039E04u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM8_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM8_1.
*/
#define	SRC_GTMATOM81	(SRC_GTM_GTM0_ATOM8_1)

/** \\brief  1E08, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM8_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039E08u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM8_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM8_2.
*/
#define	SRC_GTMATOM82	(SRC_GTM_GTM0_ATOM8_2)

/** \\brief  1E0C, GTM ATOM Shared Service Request */
#define SRC_GTM_GTM0_ATOM8_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039E0Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM8_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM8_3.
*/
#define	SRC_GTMATOM83	(SRC_GTM_GTM0_ATOM8_3)

/** \\brief  1614, GTM BRC Shared Service Request */
#define SRC_GTM_GTM0_BRCIRQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039614u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_BRCIRQ.
* To use register names with standard convension, please use SRC_GTM_GTM0_BRCIRQ.
*/
#define	SRC_GTMBRCIRQ	(SRC_GTM_GTM0_BRCIRQ)

/** \\brief  1618, GTM CMP Shared Service Request */
#define SRC_GTM_GTM0_CMPIRQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039618u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_CMPIRQ.
* To use register names with standard convension, please use SRC_GTM_GTM0_CMPIRQ.
*/
#define	SRC_GTMCMPIRQ	(SRC_GTM_GTM0_CMPIRQ)

/** \\brief  16A4, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396A4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL0.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL0.
*/
#define	SRC_GTMDPLL0	(SRC_GTM_GTM0_DPLL0)

/** \\brief  16A8, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396A8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL1.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL1.
*/
#define	SRC_GTMDPLL1	(SRC_GTM_GTM0_DPLL1)

/** \\brief  16CC, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL10 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396CCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL10.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL10.
*/
#define	SRC_GTMDPLL10	(SRC_GTM_GTM0_DPLL10)

/** \\brief  16D0, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL11 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396D0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL11.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL11.
*/
#define	SRC_GTMDPLL11	(SRC_GTM_GTM0_DPLL11)

/** \\brief  16D4, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL12 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396D4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL12.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL12.
*/
#define	SRC_GTMDPLL12	(SRC_GTM_GTM0_DPLL12)

/** \\brief  16D8, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL13 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396D8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL13.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL13.
*/
#define	SRC_GTMDPLL13	(SRC_GTM_GTM0_DPLL13)

/** \\brief  16DC, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL14 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396DCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL14.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL14.
*/
#define	SRC_GTMDPLL14	(SRC_GTM_GTM0_DPLL14)

