HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** \\brief  16E0, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL15 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396E0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL15.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL15.
*/
#define	SRC_GTMDPLL15	(SRC_GTM_GTM0_DPLL15)

/** \\brief  16E4, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL16 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396E4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL16.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL16.
*/
#define	SRC_GTMDPLL16	(SRC_GTM_GTM0_DPLL16)

/** \\brief  16E8, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL17 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396E8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL17.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL17.
*/
#define	SRC_GTMDPLL17	(SRC_GTM_GTM0_DPLL17)

/** \\brief  16EC, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL18 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396ECu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL18.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL18.
*/
#define	SRC_GTMDPLL18	(SRC_GTM_GTM0_DPLL18)

/** \\brief  16F0, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL19 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396F0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL19.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL19.
*/
#define	SRC_GTMDPLL19	(SRC_GTM_GTM0_DPLL19)

/** \\brief  16AC, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396ACu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL2.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL2.
*/
#define	SRC_GTMDPLL2	(SRC_GTM_GTM0_DPLL2)

/** \\brief  16F4, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL20 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396F4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL20.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL20.
*/
#define	SRC_GTMDPLL20	(SRC_GTM_GTM0_DPLL20)

/** \\brief  16F8, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL21 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396F8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL21.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL21.
*/
#define	SRC_GTMDPLL21	(SRC_GTM_GTM0_DPLL21)

/** \\brief  16FC, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL22 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396FCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL22.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL22.
*/
#define	SRC_GTMDPLL22	(SRC_GTM_GTM0_DPLL22)

/** \\brief  1700, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL23 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039700u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL23.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL23.
*/
#define	SRC_GTMDPLL23	(SRC_GTM_GTM0_DPLL23)

/** \\brief  1704, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL24 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039704u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL24.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL24.
*/
#define	SRC_GTMDPLL24	(SRC_GTM_GTM0_DPLL24)

/** \\brief  1708, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL25 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039708u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL25.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL25.
*/
#define	SRC_GTMDPLL25	(SRC_GTM_GTM0_DPLL25)

/** \\brief  170C, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL26 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003970Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL26.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL26.
*/
#define	SRC_GTMDPLL26	(SRC_GTM_GTM0_DPLL26)

/** \\brief  16B0, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396B0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL3.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL3.
*/
#define	SRC_GTMDPLL3	(SRC_GTM_GTM0_DPLL3)

/** \\brief  16B4, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396B4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL4.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL4.
*/
#define	SRC_GTMDPLL4	(SRC_GTM_GTM0_DPLL4)

/** \\brief  16B8, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396B8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL5.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL5.
*/
#define	SRC_GTMDPLL5	(SRC_GTM_GTM0_DPLL5)

/** \\brief  16BC, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396BCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL6.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL6.
*/
#define	SRC_GTMDPLL6	(SRC_GTM_GTM0_DPLL6)

/** \\brief  16C0, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396C0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL7.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL7.
*/
#define	SRC_GTMDPLL7	(SRC_GTM_GTM0_DPLL7)

/** \\brief  16C4, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL8 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396C4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL8.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL8.
*/
#define	SRC_GTMDPLL8	(SRC_GTM_GTM0_DPLL8)

/** \\brief  16C8, GTM DPLL Service Request */
#define SRC_GTM_GTM0_DPLL9 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00396C8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_DPLL9.
* To use register names with standard convension, please use SRC_GTM_GTM0_DPLL9.
*/
#define	SRC_GTMDPLL9	(SRC_GTM_GTM0_DPLL9)

/** \\brief  1770, GTM Error Service Request */
#define SRC_GTM_GTM0_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039770u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ERR.
* To use register names with standard convension, please use SRC_GTM_GTM0_ERR.
*/
#define	SRC_GTMERR	(SRC_GTM_GTM0_ERR)

/** \\brief  1980, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS0_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039980u)

