HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_7.
*/
#define	SRC_GTMMCS47	(SRC_GTM_GTM0_MCS4_7)

/** \\brief  1A20, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A20u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_0.
*/
#define	SRC_GTMMCS50	(SRC_GTM_GTM0_MCS5_0)

/** \\brief  1A24, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A24u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_1.
*/
#define	SRC_GTMMCS51	(SRC_GTM_GTM0_MCS5_1)

/** \\brief  1A28, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A28u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_2.
*/
#define	SRC_GTMMCS52	(SRC_GTM_GTM0_MCS5_2)

/** \\brief  1A2C, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A2Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_3.
*/
#define	SRC_GTMMCS53	(SRC_GTM_GTM0_MCS5_3)

/** \\brief  1A30, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A30u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_4.
*/
#define	SRC_GTMMCS54	(SRC_GTM_GTM0_MCS5_4)

/** \\brief  1A34, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A34u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_5.
*/
#define	SRC_GTMMCS55	(SRC_GTM_GTM0_MCS5_5)

/** \\brief  1A38, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A38u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_6.
*/
#define	SRC_GTMMCS56	(SRC_GTM_GTM0_MCS5_6)

/** \\brief  1A3C, GTM MCS Shared Service Request */
#define SRC_GTM_GTM0_MCS5_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039A3Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_7.
*/
#define	SRC_GTMMCS57	(SRC_GTM_GTM0_MCS5_7)

/** \\brief  1F00, GTM Multi Channel Sequencer 0 Service Request */
#define SRC_GTM_GTM0_MCSW00 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F00u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW00.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW00.
*/
#define	SRC_GTMMCSW00	(SRC_GTM_GTM0_MCSW00)

/** \\brief  1F04, GTM Multi Channel Sequencer 0 Service Request */
#define SRC_GTM_GTM0_MCSW01 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F04u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW01.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW01.
*/
#define	SRC_GTMMCSW01	(SRC_GTM_GTM0_MCSW01)

/** \\brief  1F08, GTM Multi Channel Sequencer 0 Service Request */
#define SRC_GTM_GTM0_MCSW02 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F08u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW02.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW02.
*/
#define	SRC_GTMMCSW02	(SRC_GTM_GTM0_MCSW02)

/** \\brief  1F0C, GTM Multi Channel Sequencer 0 Service Request */
#define SRC_GTM_GTM0_MCSW03 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F0Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW03.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW03.
*/
#define	SRC_GTMMCSW03	(SRC_GTM_GTM0_MCSW03)

/** \\brief  1F10, GTM Multi Channel Sequencer 0 Service Request */
#define SRC_GTM_GTM0_MCSW04 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F10u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW04.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW04.
*/
#define	SRC_GTMMCSW04	(SRC_GTM_GTM0_MCSW04)

/** \\brief  1F14, GTM Multi Channel Sequencer 0 Service Request */
#define SRC_GTM_GTM0_MCSW05 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F14u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW05.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW05.
*/
#define	SRC_GTMMCSW05	(SRC_GTM_GTM0_MCSW05)

/** \\brief  1F40, GTM Multi Channel Sequencer 1 Service Request */
#define SRC_GTM_GTM0_MCSW10 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F40u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW10.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW10.
*/
#define	SRC_GTMMCSW10	(SRC_GTM_GTM0_MCSW10)

/** \\brief  1F44, GTM Multi Channel Sequencer 1 Service Request */
#define SRC_GTM_GTM0_MCSW11 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F44u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW11.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW11.
*/
#define	SRC_GTMMCSW11	(SRC_GTM_GTM0_MCSW11)

/** \\brief  1F48, GTM Multi Channel Sequencer 1 Service Request */
#define SRC_GTM_GTM0_MCSW12 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F48u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW12.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW12.
*/
#define	SRC_GTMMCSW12	(SRC_GTM_GTM0_MCSW12)

/** \\brief  1F4C, GTM Multi Channel Sequencer 1 Service Request */
#define SRC_GTM_GTM0_MCSW13 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F4Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW13.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW13.
*/
#define	SRC_GTMMCSW13	(SRC_GTM_GTM0_MCSW13)

/** \\brief  1F50, GTM Multi Channel Sequencer 1 Service Request */
#define SRC_GTM_GTM0_MCSW14 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F50u)

