HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW14.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW14.
*/
#define	SRC_GTMMCSW14	(SRC_GTM_GTM0_MCSW14)

/** \\brief  1F54, GTM Multi Channel Sequencer 1 Service Request */
#define SRC_GTM_GTM0_MCSW15 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039F54u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW15.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW15.
*/
#define	SRC_GTMMCSW15	(SRC_GTM_GTM0_MCSW15)

/** \\brief  162C, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003962Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_0.
*/
#define	SRC_GTMPSM00	(SRC_GTM_GTM0_PSM0_0)

/** \\brief  1630, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039630u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_1.
*/
#define	SRC_GTMPSM01	(SRC_GTM_GTM0_PSM0_1)

/** \\brief  1634, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039634u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_2.
*/
#define	SRC_GTMPSM02	(SRC_GTM_GTM0_PSM0_2)

/** \\brief  1638, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039638u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_3.
*/
#define	SRC_GTMPSM03	(SRC_GTM_GTM0_PSM0_3)

/** \\brief  163C, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003963Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_4.
*/
#define	SRC_GTMPSM04	(SRC_GTM_GTM0_PSM0_4)

/** \\brief  1640, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039640u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_5.
*/
#define	SRC_GTMPSM05	(SRC_GTM_GTM0_PSM0_5)

/** \\brief  1644, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039644u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_6.
*/
#define	SRC_GTMPSM06	(SRC_GTM_GTM0_PSM0_6)

/** \\brief  1648, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM0_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039648u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_7.
*/
#define	SRC_GTMPSM07	(SRC_GTM_GTM0_PSM0_7)

/** \\brief  164C, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM1_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003964Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_0.
*/
#define	SRC_GTMPSM10	(SRC_GTM_GTM0_PSM1_0)

/** \\brief  1650, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM1_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039650u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_1.
*/
#define	SRC_GTMPSM11	(SRC_GTM_GTM0_PSM1_1)

/** \\brief  1654, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM1_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039654u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_2.
*/
#define	SRC_GTMPSM12	(SRC_GTM_GTM0_PSM1_2)

/** \\brief  1658, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM1_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039658u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_3.
*/
#define	SRC_GTMPSM13	(SRC_GTM_GTM0_PSM1_3)

/** \\brief  165C, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM1_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003965Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_4.
*/
#define	SRC_GTMPSM14	(SRC_GTM_GTM0_PSM1_4)

/** \\brief  1660, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM1_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039660u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_5.
*/
#define	SRC_GTMPSM15	(SRC_GTM_GTM0_PSM1_5)

/** \\brief  1664, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM1_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039664u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_6.
*/
#define	SRC_GTMPSM16	(SRC_GTM_GTM0_PSM1_6)

/** \\brief  1668, GTM PSM Shared Service Request */
#define SRC_GTM_GTM0_PSM1_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039668u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_7.
*/
#define	SRC_GTMPSM17	(SRC_GTM_GTM0_PSM1_7)

/** \\brief  161C, GTM SPE Shared Service Request */
#define SRC_GTM_GTM0_SPEIRQ0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003961Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_SPEIRQ0.
* To use register names with standard convension, please use SRC_GTM_GTM0_SPEIRQ0.
*/
#define	SRC_GTMSPE0IRQ	(SRC_GTM_GTM0_SPEIRQ0)

/** \\brief  1620, GTM SPE Shared Service Request */
#define SRC_GTM_GTM0_SPEIRQ1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039620u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_SPEIRQ1.
* To use register names with standard convension, please use SRC_GTM_GTM0_SPEIRQ1.
*/
#define	SRC_GTMSPE1IRQ	(SRC_GTM_GTM0_SPEIRQ1)

/** \\brief  1624, GTM SPE Shared Service Request */
#define SRC_GTM_GTM0_SPEIRQ2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039624u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_SPEIRQ2.
* To use register names with standard convension, please use SRC_GTM_GTM0_SPEIRQ2.
*/
#define	SRC_GTMSPE2IRQ	(SRC_GTM_GTM0_SPEIRQ2)

