HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** \\brief  1628, GTM SPE Shared Service Request */
#define SRC_GTM_GTM0_SPEIRQ3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039628u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_SPEIRQ3.
* To use register names with standard convension, please use SRC_GTM_GTM0_SPEIRQ3.
*/
#define	SRC_GTMSPE3IRQ	(SRC_GTM_GTM0_SPEIRQ3)

/** \\brief  1780, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM0_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039780u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_0.
*/
#define	SRC_GTMTIM00	(SRC_GTM_GTM0_TIM0_0)

/** \\brief  1784, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM0_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039784u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_1.
*/
#define	SRC_GTMTIM01	(SRC_GTM_GTM0_TIM0_1)

/** \\brief  1788, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM0_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039788u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_2.
*/
#define	SRC_GTMTIM02	(SRC_GTM_GTM0_TIM0_2)

/** \\brief  178C, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM0_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003978Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_3.
*/
#define	SRC_GTMTIM03	(SRC_GTM_GTM0_TIM0_3)

/** \\brief  1790, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM0_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039790u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_4.
*/
#define	SRC_GTMTIM04	(SRC_GTM_GTM0_TIM0_4)

/** \\brief  1794, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM0_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039794u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_5.
*/
#define	SRC_GTMTIM05	(SRC_GTM_GTM0_TIM0_5)

/** \\brief  1798, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM0_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039798u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_6.
*/
#define	SRC_GTMTIM06	(SRC_GTM_GTM0_TIM0_6)

/** \\brief  179C, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM0_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003979Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_7.
*/
#define	SRC_GTMTIM07	(SRC_GTM_GTM0_TIM0_7)

/** \\brief  17A0, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM1_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397A0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM1_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM1_0.
*/
#define	SRC_GTMTIM10	(SRC_GTM_GTM0_TIM1_0)

/** \\brief  17A4, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM1_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397A4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM1_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM1_1.
*/
#define	SRC_GTMTIM11	(SRC_GTM_GTM0_TIM1_1)

/** \\brief  17A8, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM1_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397A8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM1_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM1_2.
*/
#define	SRC_GTMTIM12	(SRC_GTM_GTM0_TIM1_2)

/** \\brief  17AC, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM1_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397ACu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM1_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM1_3.
*/
#define	SRC_GTMTIM13	(SRC_GTM_GTM0_TIM1_3)

/** \\brief  17B0, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM1_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397B0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM1_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM1_4.
*/
#define	SRC_GTMTIM14	(SRC_GTM_GTM0_TIM1_4)

/** \\brief  17B4, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM1_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397B4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM1_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM1_5.
*/
#define	SRC_GTMTIM15	(SRC_GTM_GTM0_TIM1_5)

/** \\brief  17B8, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM1_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397B8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM1_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM1_6.
*/
#define	SRC_GTMTIM16	(SRC_GTM_GTM0_TIM1_6)

/** \\brief  17BC, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM1_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397BCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM1_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM1_7.
*/
#define	SRC_GTMTIM17	(SRC_GTM_GTM0_TIM1_7)

/** \\brief  17C0, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397C0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_0.
*/
#define	SRC_GTMTIM20	(SRC_GTM_GTM0_TIM2_0)

/** \\brief  17C4, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397C4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_1.
*/
#define	SRC_GTMTIM21	(SRC_GTM_GTM0_TIM2_1)

/** \\brief  17C8, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397C8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_2.
*/
#define	SRC_GTMTIM22	(SRC_GTM_GTM0_TIM2_2)

/** \\brief  17CC, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397CCu)

