HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_3.
*/
#define	SRC_GTMTIM23	(SRC_GTM_GTM0_TIM2_3)

/** \\brief  17D0, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397D0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_4.
*/
#define	SRC_GTMTIM24	(SRC_GTM_GTM0_TIM2_4)

/** \\brief  17D4, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397D4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_5.
*/
#define	SRC_GTMTIM25	(SRC_GTM_GTM0_TIM2_5)

/** \\brief  17D8, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397D8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_6.
*/
#define	SRC_GTMTIM26	(SRC_GTM_GTM0_TIM2_6)

/** \\brief  17DC, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM2_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397DCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM2_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM2_7.
*/
#define	SRC_GTMTIM27	(SRC_GTM_GTM0_TIM2_7)

/** \\brief  17E0, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397E0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_0.
*/
#define	SRC_GTMTIM30	(SRC_GTM_GTM0_TIM3_0)

/** \\brief  17E4, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397E4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_1.
*/
#define	SRC_GTMTIM31	(SRC_GTM_GTM0_TIM3_1)

/** \\brief  17E8, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397E8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_2.
*/
#define	SRC_GTMTIM32	(SRC_GTM_GTM0_TIM3_2)

/** \\brief  17EC, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397ECu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_3.
*/
#define	SRC_GTMTIM33	(SRC_GTM_GTM0_TIM3_3)

/** \\brief  17F0, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397F0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_4.
*/
#define	SRC_GTMTIM34	(SRC_GTM_GTM0_TIM3_4)

/** \\brief  17F4, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397F4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_5.
*/
#define	SRC_GTMTIM35	(SRC_GTM_GTM0_TIM3_5)

/** \\brief  17F8, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397F8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_6.
*/
#define	SRC_GTMTIM36	(SRC_GTM_GTM0_TIM3_6)

/** \\brief  17FC, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM3_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00397FCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_7.
*/
#define	SRC_GTMTIM37	(SRC_GTM_GTM0_TIM3_7)

/** \\brief  1800, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039800u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_0.
*/
#define	SRC_GTMTIM40	(SRC_GTM_GTM0_TIM4_0)

/** \\brief  1804, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039804u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_1.
*/
#define	SRC_GTMTIM41	(SRC_GTM_GTM0_TIM4_1)

/** \\brief  1808, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039808u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_2.
*/
#define	SRC_GTMTIM42	(SRC_GTM_GTM0_TIM4_2)

/** \\brief  180C, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003980Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_3.
*/
#define	SRC_GTMTIM43	(SRC_GTM_GTM0_TIM4_3)

/** \\brief  1810, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039810u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_4.
*/
#define	SRC_GTMTIM44	(SRC_GTM_GTM0_TIM4_4)

/** \\brief  1814, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039814u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_5.
*/
#define	SRC_GTMTIM45	(SRC_GTM_GTM0_TIM4_5)

/** \\brief  1818, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039818u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_6.
*/
#define	SRC_GTMTIM46	(SRC_GTM_GTM0_TIM4_6)

/** \\brief  181C, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM4_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003981Cu)

