HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_7.
*/
#define	SRC_GTMTIM47	(SRC_GTM_GTM0_TIM4_7)

/** \\brief  1820, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039820u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_0.
*/
#define	SRC_GTMTIM50	(SRC_GTM_GTM0_TIM5_0)

/** \\brief  1824, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039824u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_1.
*/
#define	SRC_GTMTIM51	(SRC_GTM_GTM0_TIM5_1)

/** \\brief  1828, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039828u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_2.
*/
#define	SRC_GTMTIM52	(SRC_GTM_GTM0_TIM5_2)

/** \\brief  182C, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003982Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_3.
*/
#define	SRC_GTMTIM53	(SRC_GTM_GTM0_TIM5_3)

/** \\brief  1830, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039830u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_4.
*/
#define	SRC_GTMTIM54	(SRC_GTM_GTM0_TIM5_4)

/** \\brief  1834, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039834u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_5.
*/
#define	SRC_GTMTIM55	(SRC_GTM_GTM0_TIM5_5)

/** \\brief  1838, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039838u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_6.
*/
#define	SRC_GTMTIM56	(SRC_GTM_GTM0_TIM5_6)

/** \\brief  183C, GTM TIM Shared Service Request */
#define SRC_GTM_GTM0_TIM5_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003983Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_7.
*/
#define	SRC_GTMTIM57	(SRC_GTM_GTM0_TIM5_7)

/** \\brief  1B80, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM0_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039B80u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_0.
*/
#define	SRC_GTMTOM00	(SRC_GTM_GTM0_TOM0_0)

/** \\brief  1B84, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM0_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039B84u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_1.
*/
#define	SRC_GTMTOM01	(SRC_GTM_GTM0_TOM0_1)

/** \\brief  1B88, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM0_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039B88u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_2.
*/
#define	SRC_GTMTOM02	(SRC_GTM_GTM0_TOM0_2)

/** \\brief  1B8C, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM0_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039B8Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_3.
*/
#define	SRC_GTMTOM03	(SRC_GTM_GTM0_TOM0_3)

/** \\brief  1B90, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM0_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039B90u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_4.
*/
#define	SRC_GTMTOM04	(SRC_GTM_GTM0_TOM0_4)

/** \\brief  1B94, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM0_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039B94u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_5.
*/
#define	SRC_GTMTOM05	(SRC_GTM_GTM0_TOM0_5)

/** \\brief  1B98, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM0_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039B98u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_6.
*/
#define	SRC_GTMTOM06	(SRC_GTM_GTM0_TOM0_6)

/** \\brief  1B9C, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM0_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039B9Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_7.
*/
#define	SRC_GTMTOM07	(SRC_GTM_GTM0_TOM0_7)

/** \\brief  1BA0, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM1_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BA0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM1_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM1_0.
*/
#define	SRC_GTMTOM10	(SRC_GTM_GTM0_TOM1_0)

/** \\brief  1BA4, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM1_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BA4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM1_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM1_1.
*/
#define	SRC_GTMTOM11	(SRC_GTM_GTM0_TOM1_1)

/** \\brief  1BA8, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM1_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BA8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM1_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM1_2.
*/
#define	SRC_GTMTOM12	(SRC_GTM_GTM0_TOM1_2)

/** \\brief  1BAC, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM1_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BACu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM1_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM1_3.
*/
#define	SRC_GTMTOM13	(SRC_GTM_GTM0_TOM1_3)

/** \\brief  1BB0, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM1_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BB0u)

