HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM1_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM1_4.
*/
#define	SRC_GTMTOM14	(SRC_GTM_GTM0_TOM1_4)

/** \\brief  1BB4, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM1_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BB4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM1_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM1_5.
*/
#define	SRC_GTMTOM15	(SRC_GTM_GTM0_TOM1_5)

/** \\brief  1BB8, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM1_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BB8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM1_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM1_6.
*/
#define	SRC_GTMTOM16	(SRC_GTM_GTM0_TOM1_6)

/** \\brief  1BBC, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM1_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BBCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM1_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM1_7.
*/
#define	SRC_GTMTOM17	(SRC_GTM_GTM0_TOM1_7)

/** \\brief  1BC0, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM2_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BC0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM2_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM2_0.
*/
#define	SRC_GTMTOM20	(SRC_GTM_GTM0_TOM2_0)

/** \\brief  1BC4, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM2_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BC4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM2_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM2_1.
*/
#define	SRC_GTMTOM21	(SRC_GTM_GTM0_TOM2_1)

/** \\brief  1BC8, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM2_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BC8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM2_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM2_2.
*/
#define	SRC_GTMTOM22	(SRC_GTM_GTM0_TOM2_2)

/** \\brief  1BCC, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM2_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BCCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM2_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM2_3.
*/
#define	SRC_GTMTOM23	(SRC_GTM_GTM0_TOM2_3)

/** \\brief  1BD0, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM2_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BD0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM2_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM2_4.
*/
#define	SRC_GTMTOM24	(SRC_GTM_GTM0_TOM2_4)

/** \\brief  1BD4, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM2_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BD4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM2_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM2_5.
*/
#define	SRC_GTMTOM25	(SRC_GTM_GTM0_TOM2_5)

/** \\brief  1BD8, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM2_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BD8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM2_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM2_6.
*/
#define	SRC_GTMTOM26	(SRC_GTM_GTM0_TOM2_6)

/** \\brief  1BDC, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM2_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BDCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM2_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM2_7.
*/
#define	SRC_GTMTOM27	(SRC_GTM_GTM0_TOM2_7)

/** \\brief  1BE0, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BE0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_0.
*/
#define	SRC_GTMTOM30	(SRC_GTM_GTM0_TOM3_0)

/** \\brief  1BE4, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BE4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_1.
*/
#define	SRC_GTMTOM31	(SRC_GTM_GTM0_TOM3_1)

/** \\brief  1BE8, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BE8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_2.
*/
#define	SRC_GTMTOM32	(SRC_GTM_GTM0_TOM3_2)

/** \\brief  1BEC, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BECu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_3.
*/
#define	SRC_GTMTOM33	(SRC_GTM_GTM0_TOM3_3)

/** \\brief  1BF0, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BF0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_4.
*/
#define	SRC_GTMTOM34	(SRC_GTM_GTM0_TOM3_4)

/** \\brief  1BF4, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BF4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_5.
*/
#define	SRC_GTMTOM35	(SRC_GTM_GTM0_TOM3_5)

/** \\brief  1BF8, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BF8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_6.
*/
#define	SRC_GTMTOM36	(SRC_GTM_GTM0_TOM3_6)

/** \\brief  1BFC, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM3_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039BFCu)

