HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_7.
*/
#define	SRC_GTMTOM37	(SRC_GTM_GTM0_TOM3_7)

/** \\brief  1C00, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C00u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_0.
*/
#define	SRC_GTMTOM40	(SRC_GTM_GTM0_TOM4_0)

/** \\brief  1C04, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C04u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_1.
*/
#define	SRC_GTMTOM41	(SRC_GTM_GTM0_TOM4_1)

/** \\brief  1C08, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C08u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_2.
*/
#define	SRC_GTMTOM42	(SRC_GTM_GTM0_TOM4_2)

/** \\brief  1C0C, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C0Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_3.
*/
#define	SRC_GTMTOM43	(SRC_GTM_GTM0_TOM4_3)

/** \\brief  1C10, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C10u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_4.
*/
#define	SRC_GTMTOM44	(SRC_GTM_GTM0_TOM4_4)

/** \\brief  1C14, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C14u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_5.
*/
#define	SRC_GTMTOM45	(SRC_GTM_GTM0_TOM4_5)

/** \\brief  1C18, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C18u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_6.
*/
#define	SRC_GTMTOM46	(SRC_GTM_GTM0_TOM4_6)

/** \\brief  1C1C, GTM TOM Shared Service Request */
#define SRC_GTM_GTM0_TOM4_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0039C1Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_7.
*/
#define	SRC_GTMTOM47	(SRC_GTM_GTM0_TOM4_7)

/** \\brief  290, HSCT Service Request */
#define SRC_HSCT_HSCT0_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038290u)

/** Alias (User Manual Name) for SRC_HSCT_HSCT0_SR.
* To use register names with standard convension, please use SRC_HSCT_HSCT0_SR.
*/
#define	SRC_HSCT	(SRC_HSCT_HSCT0_SR)

/** \\brief  CC0, HSM Service Request */
#define SRC_HSM_HSM0_HSM0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CC0u)

/** Alias (User Manual Name) for SRC_HSM_HSM0_HSM0.
* To use register names with standard convension, please use SRC_HSM_HSM0_HSM0.
*/
#define	SRC_HSM0	(SRC_HSM_HSM0_HSM0)

/** \\brief  CC4, HSM Service Request */
#define SRC_HSM_HSM0_HSM1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CC4u)

/** Alias (User Manual Name) for SRC_HSM_HSM0_HSM1.
* To use register names with standard convension, please use SRC_HSM_HSM0_HSM1.
*/
#define	SRC_HSM1	(SRC_HSM_HSM0_HSM1)

/** \\brief  2E0, Exception Service Request */
#define SRC_HSSL_EXI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382E0u)

/** Alias (User Manual Name) for SRC_HSSL_EXI.
* To use register names with standard convension, please use SRC_HSSL_EXI.
*/
#define	SRC_HSSLEXI	(SRC_HSSL_EXI)

/** \\brief  2A0, Channel OK Service Request m */
#define SRC_HSSL_HSSL0_COK /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382A0u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_COK.
*/
#define	SRC_HSSLCOK0	(SRC_HSSL_HSSL0_COK)

/** \\brief  2A8, Channel Error ServiceRequest m */
#define SRC_HSSL_HSSL0_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382A8u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_ERR.
*/
#define	SRC_HSSLERR0	(SRC_HSSL_HSSL0_ERR)

/** \\brief  2A4, Channel Read Data Service Request m */
#define SRC_HSSL_HSSL0_RDI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382A4u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_RDI.
*/
#define	SRC_HSSLRDI0	(SRC_HSSL_HSSL0_RDI)

/** \\brief  2AC, Channel Trigger Service Request m */
#define SRC_HSSL_HSSL0_TRG /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382ACu)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_TRG.
*/
#define	SRC_HSSLTRG0	(SRC_HSSL_HSSL0_TRG)

/** \\brief  2B0, Channel OK Service Request m */
#define SRC_HSSL_HSSL1_COK /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382B0u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_COK.
*/
#define	SRC_HSSLCOK1	(SRC_HSSL_HSSL1_COK)

/** \\brief  2B8, Channel Error ServiceRequest m */
#define SRC_HSSL_HSSL1_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382B8u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_ERR.
*/
#define	SRC_HSSLERR1	(SRC_HSSL_HSSL1_ERR)

/** \\brief  2B4, Channel Read Data Service Request m */
#define SRC_HSSL_HSSL1_RDI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382B4u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_RDI.
*/
#define	SRC_HSSLRDI1	(SRC_HSSL_HSSL1_RDI)

/** \\brief  2BC, Channel Trigger Service Request m */
#define SRC_HSSL_HSSL1_TRG /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382BCu)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_TRG.
*/
#define	SRC_HSSLTRG1	(SRC_HSSL_HSSL1_TRG)

/** \\brief  2C0, Channel OK Service Request m */
#define SRC_HSSL_HSSL2_COK /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382C0u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL2_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL2_COK.
*/
#define	SRC_HSSLCOK2	(SRC_HSSL_HSSL2_COK)

/** \\brief  2C8, Channel Error ServiceRequest m */
#define SRC_HSSL_HSSL2_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382C8u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL2_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL2_ERR.
*/
#define	SRC_HSSLERR2	(SRC_HSSL_HSSL2_ERR)

