HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** \\brief  2C4, Channel Read Data Service Request m */
#define SRC_HSSL_HSSL2_RDI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382C4u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL2_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL2_RDI.
*/
#define	SRC_HSSLRDI2	(SRC_HSSL_HSSL2_RDI)

/** \\brief  2CC, Channel Trigger Service Request m */
#define SRC_HSSL_HSSL2_TRG /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382CCu)

/** Alias (User Manual Name) for SRC_HSSL_HSSL2_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL2_TRG.
*/
#define	SRC_HSSLTRG2	(SRC_HSSL_HSSL2_TRG)

/** \\brief  2D0, Channel OK Service Request m */
#define SRC_HSSL_HSSL3_COK /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382D0u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL3_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL3_COK.
*/
#define	SRC_HSSLCOK3	(SRC_HSSL_HSSL3_COK)

/** \\brief  2D8, Channel Error ServiceRequest m */
#define SRC_HSSL_HSSL3_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382D8u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL3_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL3_ERR.
*/
#define	SRC_HSSLERR3	(SRC_HSSL_HSSL3_ERR)

/** \\brief  2D4, Channel Read Data Service Request m */
#define SRC_HSSL_HSSL3_RDI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382D4u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL3_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL3_RDI.
*/
#define	SRC_HSSLRDI3	(SRC_HSSL_HSSL3_RDI)

/** \\brief  2DC, Channel Trigger Service Request m */
#define SRC_HSSL_HSSL3_TRG /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382DCu)

/** Alias (User Manual Name) for SRC_HSSL_HSSL3_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL3_TRG.
*/
#define	SRC_HSSLTRG3	(SRC_HSSL_HSSL3_TRG)

/** \\brief  300, I2C Burst Data Transfer Request */
#define SRC_I2C_I2C0_BREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038300u)

/** Alias (User Manual Name) for SRC_I2C_I2C0_BREQ.
* To use register names with standard convension, please use SRC_I2C_I2C0_BREQ.
*/
#define	SRC_I2C0BREQ	(SRC_I2C_I2C0_BREQ)

/** \\brief  310, I2C Error Service Request */
#define SRC_I2C_I2C0_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038310u)

/** Alias (User Manual Name) for SRC_I2C_I2C0_ERR.
* To use register names with standard convension, please use SRC_I2C_I2C0_ERR.
*/
#define	SRC_I2C0ERR	(SRC_I2C_I2C0_ERR)

/** \\brief  304, I2C Last Burst Data Transfer Service Request */
#define SRC_I2C_I2C0_LBREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038304u)

/** Alias (User Manual Name) for SRC_I2C_I2C0_LBREQ.
* To use register names with standard convension, please use SRC_I2C_I2C0_LBREQ.
*/
#define	SRC_I2C0LBREQ	(SRC_I2C_I2C0_LBREQ)

/** \\brief  30C, I2C Last Single Data Transfer Service Request */
#define SRC_I2C_I2C0_LSREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003830Cu)

/** Alias (User Manual Name) for SRC_I2C_I2C0_LSREQ.
* To use register names with standard convension, please use SRC_I2C_I2C0_LSREQ.
*/
#define	SRC_I2C0LSREQ	(SRC_I2C_I2C0_LSREQ)

/** \\brief  314, I2C Kernel Service Request */
#define SRC_I2C_I2C0_P /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038314u)

/** Alias (User Manual Name) for SRC_I2C_I2C0_P.
* To use register names with standard convension, please use SRC_I2C_I2C0_P.
*/
#define	SRC_I2C0P	(SRC_I2C_I2C0_P)

/** \\brief  308, I2C Single Data Transfer Service Request */
#define SRC_I2C_I2C0_SREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038308u)

/** Alias (User Manual Name) for SRC_I2C_I2C0_SREQ.
* To use register names with standard convension, please use SRC_I2C_I2C0_SREQ.
*/
#define	SRC_I2C0SREQ	(SRC_I2C_I2C0_SREQ)

/** \\brief  318, I2C Burst Data Transfer Request */
#define SRC_I2C_I2C1_BREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038318u)

/** Alias (User Manual Name) for SRC_I2C_I2C1_BREQ.
* To use register names with standard convension, please use SRC_I2C_I2C1_BREQ.
*/
#define	SRC_I2C1BREQ	(SRC_I2C_I2C1_BREQ)

/** \\brief  328, I2C Error Service Request */
#define SRC_I2C_I2C1_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038328u)

/** Alias (User Manual Name) for SRC_I2C_I2C1_ERR.
* To use register names with standard convension, please use SRC_I2C_I2C1_ERR.
*/
#define	SRC_I2C1ERR	(SRC_I2C_I2C1_ERR)

/** \\brief  31C, I2C Last Burst Data Transfer Service Request */
#define SRC_I2C_I2C1_LBREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003831Cu)

/** Alias (User Manual Name) for SRC_I2C_I2C1_LBREQ.
* To use register names with standard convension, please use SRC_I2C_I2C1_LBREQ.
*/
#define	SRC_I2C1LBREQ	(SRC_I2C_I2C1_LBREQ)

/** \\brief  324, I2C Last Single Data Transfer Service Request */
#define SRC_I2C_I2C1_LSREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038324u)

/** Alias (User Manual Name) for SRC_I2C_I2C1_LSREQ.
* To use register names with standard convension, please use SRC_I2C_I2C1_LSREQ.
*/
#define	SRC_I2C1LSREQ	(SRC_I2C_I2C1_LSREQ)

/** \\brief  32C, I2C Kernel Service Request */
#define SRC_I2C_I2C1_P /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003832Cu)

/** Alias (User Manual Name) for SRC_I2C_I2C1_P.
* To use register names with standard convension, please use SRC_I2C_I2C1_P.
*/
#define	SRC_I2C1P	(SRC_I2C_I2C1_P)

/** \\brief  320, I2C Single Data Transfer Service Request */
#define SRC_I2C_I2C1_SREQ /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038320u)

/** Alias (User Manual Name) for SRC_I2C_I2C1_SREQ.
* To use register names with standard convension, please use SRC_I2C_I2C1_SREQ.
*/
#define	SRC_I2C1SREQ	(SRC_I2C_I2C1_SREQ)

/** \\brief  DE0, LMU Service Request */
#define SRC_LMU_LMU0_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DE0u)

/** Alias (User Manual Name) for SRC_LMU_LMU0_SR.
* To use register names with standard convension, please use SRC_LMU_LMU0_SR.
*/
#define	SRC_LMU	(SRC_LMU_LMU0_SR)

