HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_QSPI_QSPI4_RX.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_RX.
*/
#define	SRC_QSPI4RX	(SRC_QSPI_QSPI4_RX)

/** \\brief  1F0, QSPI Transmit Service Request */
#define SRC_QSPI_QSPI4_TX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381F0u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI4_TX.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_TX.
*/
#define	SRC_QSPI4TX	(SRC_QSPI_QSPI4_TX)

/** \\brief  204, QSPI User Defined Service Request */
#define SRC_QSPI_QSPI4_U /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038204u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI4_U.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_U.
*/
#define	SRC_QSPI4U	(SRC_QSPI_QSPI4_U)

/** \\brief  210, QSPI Error Service Request */
#define SRC_QSPI_QSPI5_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038210u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_ERR.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_ERR.
*/
#define	SRC_QSPI5ERR	(SRC_QSPI_QSPI5_ERR)

/** \\brief  218, QSPI High Speed Capture Service Request */
#define SRC_QSPI_QSPI5_HC /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038218u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_HC.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_HC.
*/
#define	SRC_RESERVED15	(SRC_QSPI_QSPI5_HC)

/** \\brief  214, QSPI Phase Transition Service Request */
#define SRC_QSPI_QSPI5_PT /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038214u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_PT.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_PT.
*/
#define	SRC_QSPI5PT	(SRC_QSPI_QSPI5_PT)

/** \\brief  20C, QSPI Receive Service Request */
#define SRC_QSPI_QSPI5_RX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003820Cu)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_RX.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_RX.
*/
#define	SRC_QSPI5RX	(SRC_QSPI_QSPI5_RX)

/** \\brief  208, QSPI Transmit Service Request */
#define SRC_QSPI_QSPI5_TX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038208u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_TX.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_TX.
*/
#define	SRC_QSPI5TX	(SRC_QSPI_QSPI5_TX)

/** \\brief  21C, QSPI User Defined Service Request */
#define SRC_QSPI_QSPI5_U /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003821Cu)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_U.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_U.
*/
#define	SRC_QSPI5U	(SRC_QSPI_QSPI5_U)

/** \\brief  CD0, SCU DTS Busy Service Request */
#define SRC_SCU_SCU_DTS /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CD0u)

/** Alias (User Manual Name) for SRC_SCU_SCU_DTS.
* To use register names with standard convension, please use SRC_SCU_SCU_DTS.
*/
#define	SRC_SCUDTS	(SRC_SCU_SCU_DTS)

/** \\brief  CD4, SCU ERU Service Request */
#define SRC_SCU_SCU_ERU0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CD4u)

/** Alias (User Manual Name) for SRC_SCU_SCU_ERU0.
* To use register names with standard convension, please use SRC_SCU_SCU_ERU0.
*/
#define	SRC_SCUERU0	(SRC_SCU_SCU_ERU0)

/** \\brief  CD8, SCU ERU Service Request */
#define SRC_SCU_SCU_ERU1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CD8u)

/** Alias (User Manual Name) for SRC_SCU_SCU_ERU1.
* To use register names with standard convension, please use SRC_SCU_SCU_ERU1.
*/
#define	SRC_SCUERU1	(SRC_SCU_SCU_ERU1)

/** \\brief  CDC, SCU ERU Service Request */
#define SRC_SCU_SCU_ERU2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CDCu)

/** Alias (User Manual Name) for SRC_SCU_SCU_ERU2.
* To use register names with standard convension, please use SRC_SCU_SCU_ERU2.
*/
#define	SRC_SCUERU2	(SRC_SCU_SCU_ERU2)

/** \\brief  CE0, SCU ERU Service Request */
#define SRC_SCU_SCU_ERU3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CE0u)

/** Alias (User Manual Name) for SRC_SCU_SCU_ERU3.
* To use register names with standard convension, please use SRC_SCU_SCU_ERU3.
*/
#define	SRC_SCUERU3	(SRC_SCU_SCU_ERU3)

/** \\brief  350, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038350u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR0.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR0.
*/
#define	SRC_SENT0	(SRC_SENT_SENT0_SR0)

/** \\brief  354, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038354u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR1.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR1.
*/
#define	SRC_SENT1	(SRC_SENT_SENT0_SR1)

/** \\brief  378, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR10 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038378u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR10.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR10.
*/
#define	SRC_SENT10	(SRC_SENT_SENT0_SR10)

/** \\brief  37C, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR11 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003837Cu)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR11.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR11.
*/
#define	SRC_SENT11	(SRC_SENT_SENT0_SR11)

/** \\brief  380, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR12 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038380u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR12.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR12.
*/
#define	SRC_SENT12	(SRC_SENT_SENT0_SR12)

/** \\brief  384, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR13 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038384u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR13.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR13.
*/
#define	SRC_SENT13	(SRC_SENT_SENT0_SR13)

/** \\brief  388, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR14 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038388u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR14.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR14.
*/
#define	SRC_SENT14	(SRC_SENT_SENT0_SR14)

/** \\brief  358, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038358u)

